Revit 2027 API
PathReinSpanSymbol.Create Method
 Creates a new instance of PathReinSpanSymbol in the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PathReinSpanSymbol Create(
	Document document,
	ElementId viewId,
	LinkElementId hostId,
	XYZ point,
	ElementId symbolId
)
Public Shared Function Create (
	document As Document,
	viewId As ElementId,
	hostId As LinkElementId,
	point As XYZ,
	symbolId As ElementId
) As PathReinSpanSymbol
public:
static PathReinSpanSymbol^ Create(
	Document^ document,
	ElementId^ viewId,
	LinkElementId^ hostId,
	XYZ^ point,
	ElementId^ symbolId
)
static member Create :
        document : Document *
        viewId : ElementId *
        hostId : LinkElementId *
        point : XYZ *
        symbolId : ElementId -> PathReinSpanSymbol
Parameters
document Document
 The document.
viewId ElementId
 The id of the view in which the symbol should appear.
hostId LinkElementId
 The ElementId of PathReinforcement (either in the document, or linked from another document).
point XYZ
 The span symbol's head position.
symbolId ElementId
 The family symbol id of this element.
Return Value
PathReinSpanSymbol
 A reference to newly created span symbol.
Exceptions
Exception | Condition
ArgumentException |  hostId should refer to a PathReinforcement element. -or- viewId does not refer to a valid view type for FabricReinSpanSymbol - only floor plan, reflected ceiling plans and elevations are permitted. -or- symbolId should refer to a FamilySymbol of category OST_FabricReinSpanSymbol.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PathReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace